[
  {
    "problem": "By dropping a game to the pathetic Tampa Bay Devil Rays, we may be on the verge of another Red Sox collapse.",
    "type": "DM"
  },
  {
    "problem": "Although, if history is any indication, the tease could still go on for several weeks.",
    "type": "FRAG"
  },
  {
    "problem": "The Sox almost never go down uneventfully, which is the most frustrating thing for their legion of fans.",
    "type": "PR"
  },
  {
    "problem": "Because of the accumulated bad karma that hangs over the franchise, the skill of the players in any given year seem to be irrelevant to the outcome.",
    "type": "AGREE"
  },
  {
    "problem": "The team not only has squandered huge leads but also it has come roaring from behind only to fall short.to fall short.",
    "type": "PAR"
  },
  {
    "problem": "The many disappointments over the years leave fans wanting to tear their hair out; or possibly organize a boycott of Fenway Park.",
    "type": "FRAG"
  },
  {
    "problem": "In each of the last four World Series the Red Sox have played, their opponents have won exactly one more game than them.",
    "type": "CASE"
  },
  {
    "problem": "In 1986, the Sox were just one strike away from a World Championship against the Mets, then the roof fell in.",
    "type": "ROS"
  },
  {
    "problem": "Still, the most painful moment may have come in the last playoff game in 2003 when Manager Little left Pedro Martinez on the mound to take a beating that the bullpen could probably have prevented.",
    "type": "A"
  },
  {
    "problem": "Fans everywhere wondered how Little could have made such a stupid decision as they lay sleepless in their beds that night.",
    "type": "MM"
  },
  {
    "problem": "After a mysterious but effective advertising campaign, Krusty loses the ratings war between Gabbo and he.",
    "type": "CASE"
  },
  {
    "problem": "The Gabbo show doesn't just dominate the market, it actually drives Krusty from the air.",
    "type": "ROS"
  },
  {
    "problem": "The ingenuous phrase that Gabbo uses repeatedly wins laughs from his audience.",
    "type": "MM"
  },
  {
    "problem": "Inspired by their love for Krusty, who has been their favorite entertainer throughout their childhood, Bart and Lisa swing into action with a plan to rehabilitate him.",
    "type": "A"
  },
  {
    "problem": "A ventriloquist’s dummy should watch its back when it is both up against a determined clown and two wily kids.",
    "type": "PAR"
  },
  {
    "problem": "Bart reveals to Gabbo's fans that he has a weakness for indecent language.",
    "type": "PR"
  },
  {
    "problem": "Soliciting the help of a large crew of celebrities, a Krusty comeback special is arranged by Bart and Lisa.",
    "type": "DM"
  },
  {
    "problem": "Featuring Bette Midler, who cozies up to Krusty and sings \"You Are the Wind Beneath My Wings\" in her smoky, sensual voice.",
    "type": "FRAG"
  },
  {
    "problem": "With Johnny Carson, Luke Perry, and the Red Hot Chili Peppers all pitching in, the show is a tremendous hit, therefore the network decides to renew Krusty's contract.",
    "type": "ROS"
  },
  {
    "problem": "Because they stuck by him and to thank them for organizing his comeback, Krusty throws a party for the children at Moe's and agrees to let them keep 50% of the T-shirt sales.",
    "type": "PAR"
  },
  {
    "problem": "The tenant, whose claims to have been educated at Oxford  were unverified, was obviously a tremendous reader: they were stacked on his desk, under his bed, beside the sink, and even in the kitchen cabinets.",
    "type": "PR"
  },
  {
    "problem": "Having been stalled in committee for months, the promotion for which I made such an extraordinary effort went to someone else because of a personality conflict between my boss and I.",
    "type": "CASE"
  },
  {
    "problem": "Homer wondered whether he could climb Mount  Springfield  without oxygen while he sat on the famous living room couch, which appears in every episode, and ate Pringles straight from the tube.",
    "type": "MM"
  },
  {
    "problem": "The students not only held a wild party but also lied about it when they were questioned, therefore the D.C. imposed a severe punishment.",
    "type": "ROS"
  },
  {
    "problem": "Preparing to fight Drederick Tatum for the world heavyweight crown, the story of Mo's boxing career, which thrived on inventive rules violations, inspires Homer to fill his own gloves with barbed wire.",
    "type": "DM"
  },
  {
    "problem": "Neither the team, which pays Pedro's salary, nor the fans, who idolize him, were thrilled by his lackluster performance in the month of September.",
    "type": "A"
  },
  {
    "problem": "The students who didn't study for the grammar test earned low grades. Although Rosamund, whose grammatical intuition was good, did better than the rest of them.",
    "type": "FRAG"
  },
  {
    "problem": "Tom reminded Zachary that because of the 2000-word paper, which remained to be written, he would not have time for either a party or a movie that night.",
    "type": "PR"
  },
  {
    "problem": "Stability being an important value, a computer that comes equipped with many expensive bells and whistles are not necessarily superior to a well-engineered low-end machine.",
    "type": "AGREE"
  },
  {
    "problem": "In the interests of getting into college, Zack has studied diligently, cultivated his skills, and he has curried favor with whoever might be willing to write him a recommendation.",
    "type": "PAR"
  },
  {
    "problem": "The cove ended in a tidal pond, which had once been dammed to power a mill wheel.",
    "type": "A"
  },
  {
    "problem": "Frosty in the early morning when the first rays of the sun had barely cleared the second-growth pines to the east.",
    "type": "FRAG"
  },
  {
    "problem": "The equipment truck, with all the uniforms, cleats, bats, and balls, and even the supplies of gum and chewing tobacco, were lost in the wilds of southern New Jersey for eighteen hours.",
    "type": "AGREE"
  },
  {
    "problem": "The inheritance means less to me than my sister.",
    "type": "PAR"
  },
  {
    "problem": "Because of the resistance put up by Jim and I, the authorities have agreed to reconsider the question.",
    "type": "CASE"
  },
  {
    "problem": "Henri remembered how much he loved Madeleine as he leafed through the photo album.",
    "type": "MM"
  },
  {
    "problem": "By dredging the beds with giant scoops, the local oyster population was brought to the verge of extinction.",
    "type": "DM"
  },
  {
    "problem": "To err is human, however, a little practice will permit one to avoid most Megablunders.",
    "type": "ROS"
  },
  {
    "problem": "We spent a month completing a 5000-piece jigsaw puzzle on the dining room table, which annoyed my grandmother considerably.",
    "type": "PR"
  },
  {
    "problem": "Driving cars that get 15 miles per gallon is a good idea neither for ourselves nor future generations.",
    "type": "PAR"
  },
  {
    "problem": "Ulysses promised to strive, to seek, to find, and that he would never yield.",
    "type": "PAR"
  },
  {
    "problem": "As a responsible hiker, we should take care of our own equipment so that the guides can concentrate on following the trail.",
    "type": "AGREE"
  },
  {
    "problem": "Dangling from the lip of a thousand-foot precipice, sleet began to fall.",
    "type": "DM"
  },
  {
    "problem": "The problem was not that there were too many visitors, it was that the ferry didn't make enough trips.",
    "type": "ROS"
  },
  {
    "problem": "The teacher offered a prize of ten snack bar dollars for whomever committed the fewest Megablunders in the course of the year.",
    "type": "CASE"
  },
  {
    "problem": "When the Ostrogoths encountered the Visigoths at Tintinium in A.D. 479, they were put to flight in less than an hour.",
    "type": "PR"
  },
  {
    "problem": "All things being equal, Stephen was sure that the friendship between Jack and him would survive even Jack's most pig-headed behavior.",
    "type": "A"
  },
  {
    "problem": "The trouble with tennis is that people who play often suffer severe elbow pain.",
    "type": "MM"
  },
  {
    "problem": "Dressed to kill in a buckskin jacket that had a pleated waist, velvet lapels, and a built-in holster.",
    "type": "FRAG"
  },
  {
    "problem": "A seal that when it saw us left the rock hurriedly with a loud slap of its tail.",
    "type": "FRAG"
  },
  {
    "problem": "Both by generous encouragement and occasional pointed criticism, the coach got the best out of his team.",
    "type": "PAR"
  },
  {
    "problem": "The player who all the fans love best is free-swinging David Ortiz.",
    "type": "CASE"
  },
  {
    "problem": "I learned that my car had been stolen because the police called me at three in the morning.",
    "type": "MM"
  },
  {
    "problem": "An old-fashioned dress with its many buttons, hooks and bows were very time-consuming for a woman to put on.",
    "type": "AGREE"
  },
  {
    "problem": "In The Caucasian Chalk Circle , Brecht proposes that what there is should be awarded to whoever will take the best care of it.",
    "type": "A"
  },
  {
    "problem": "Squire Western drinks immoderately and throws greasy table scraps to his dogs, which causes his sister to denounce him as a \"perfect boor.\"",
    "type": "PR"
  },
  {
    "problem": "Snead needed only to make an 18-inch putt for the championship, however he pulled it wide left, lost a playoff, and finished second.",
    "type": "ROS"
  },
  {
    "problem": "Crusted with a dozen different shades of moss and lichens, we found the boulder remarkably beautiful.",
    "type": "DM"
  },
  {
    "problem": "The stakes are much greater for she and I than for my brother.",
    "type": "CASE"
  },
  {
    "problem": "Although there were parasites invading Robert's kidney, the doctor said that it didn't matter.",
    "type": "PR"
  },
  {
    "problem": "Schilling has pitched ineffectively out of the bullpen, in fact he gave up two home runs in his most recent appearance.",
    "type": "ROS"
  },
  {
    "problem": "At Gettysburg, Lincoln promoted government of the people, by the people, and serving the people's best interests.",
    "type": "PAR"
  },
  {
    "problem": "Following the coastline closely, U.S. Route 1 is certainly the most scenic road in California.",
    "type": "A"
  },
  {
    "problem": "The top scorers--Jared, Tyler, Zack, and me--received trophies and certificates.",
    "type": "CASE"
  },
  {
    "problem": "When American readers, who had waited anxiously for weeks, swarmed the docks in anticipation of the latest installment of Dickens's current novel.",
    "type": "FRAG"
  },
  {
    "problem": "Two bats inhabited the clock tower, which came out at night to hunt for insects.",
    "type": "MM"
  },
  {
    "problem": "To insert a model ship into a bottle, the masts must be collapsed so that they lie flat on the deck.",
    "type": "DM"
  },
  {
    "problem": "Neither of the two kittens at the pet store were particularly friendly; Jeremy could understand, however, why young creatures in a crowded store might feel shy.",
    "type": "AGREE"
  },
  {
    "problem": "Maggie asked Eliza if she should shut down the switchboard for the night.",
    "type": "PR"
  },
  {
    "problem": "Although said to be lively, affectionate, and easy to train, I cannot imagine why anyone would want such an ill-looking dog.",
    "type": "DM"
  },
  {
    "problem": "This little ball of fur, originating from Germany , only stands at most 12 inches high.",
    "type": "MM"
  },
  {
    "problem": "Thoroughbreds are bred to have long legs, big hearts and lungs, wide rib cages, light bones, and able to carry minimum weight at speeds up to 35 mph.",
    "type": "PAR"
  },
  {
    "problem": "Everyone eats cereal, some eat it because it has a unique taste and others because they like to read the back of the cereal's box.",
    "type": "ROS"
  },
  {
    "problem": "The ongoing modifications to the Mini Wheats package provides entertainment for dull mornings.",
    "type": "AGREE"
  },
  {
    "problem": "Fighting Freaks 7 is a very complicated game and appeals to someone whom has a lot of time on his hands.",
    "type": "CASE"
  },
  {
    "problem": "Rated \"Teen\" by ESRB because of animated violence and very mild language, you can expect Fighting Freaks 7 to appear in the hands of teenagers during the summer.",
    "type": "DM"
  },
  {
    "problem": "Bond is always in a helpless and vulnerable position, nevertheless he makes sarcastic remarks about the enemy's plan.",
    "type": "ROS"
  },
  {
    "problem": "Thoroughbreds are intended primarily for racing, which means that they must be extremely fast.",
    "type": "PR"
  },
  {
    "problem": "I carefully peel away the rough black paper that's partially stuck to the bottom of the chocolate cup with my right hand.",
    "type": "MM"
  },
  {
    "problem": "The 11-year-old Shakespeare may have witnessed the Queen's visit to nearby Kenilworth  in 1575; there is, however, no documentary evidence.",
    "type": "A"
  },
  {
    "problem": "I barely saw ten geese on the banks of a pond where they used to come by the thousands.",
    "type": "MM"
  },
  {
    "problem": "No matter how rough and daunting the path may appear, one should never hesitate to follow their dreams.",
    "type": "AGREE"
  },
  {
    "problem": "The package went unclaimed because the student who it was addressed to never received notification.",
    "type": "CASE"
  },
  {
    "problem": "According to the regulations, permission to carry a nail clipper on board can be granted by either the gate attendant or by the captain.",
    "type": "PAR"
  },
  {
    "problem": "Homer attempted to dispose of his lighted firecracker in the dishwasher; this caused a catastrophic flood in the kitchen of Flanders 's summer cottage.",
    "type": "PR"
  },
  {
    "problem": "Jules reaches a bold conclusion, he can keep Kathe only by sharing her with Jim.",
    "type": "ROS"
  },
  {
    "problem": "The computer, which required thousands of vacuum tubes, were so big that the company had to construct a special building.",
    "type": "AGREE"
  },
  {
    "problem": "Sauteed in a mixture of goose fat and butter, Mme. Reynaud admitted that her potato dish was not for people who needed to lose weight.",
    "type": "DM"
  },
  {
    "problem": "Because the sum that the president initially promised was equal to the amount spent every five hours on the war in Iraq.",
    "type": "FRAG"
  },
  {
    "problem": "Because Tom Wolfe invented a new kind of journalism that captured subjective elements missing from traditional newspaper stories.",
    "type": "FRAG"
  },
  {
    "problem": "Both by assuming the points of view of his characters and an extravagant, almost hysterical prose style, Wolfe outraged many old-school journalists.",
    "type": "PAR"
  },
  {
    "problem": "The White House even expressed its displeasure when Wolfe published a sharp critique of the New Yorker  magazine, which was a sacred cow in intellectual circles.",
    "type": "MM"
  },
  {
    "problem": "He made fun of the New Yorker's  obsessive fact-checking and also of its fanatical dedication to its own past--dedication that turned the magazine's offices into a kind of museum.",
    "type": "A"
  },
  {
    "problem": "A magazine that reverently preserves the doodles of long-dead contributors on its office walls are probably not operating on the cutting-edge of journalistic innovation.",
    "type": "AGREE"
  },
  {
    "problem": "A responsible writer must of course check facts carefully, but a legion of fact-checkers and copy editors are also capable of ruining a good story by squeezing the personal voice out of it.",
    "type": "AGREE"
  },
  {
    "problem": "Believing that a journalist should plunge into the liveliest experience of his time, drug experimentation in San Francisco  became the subject of Wolfe's first full-length book, The Electric Kool-Aid Acid Test.",
    "type": "DM"
  },
  {
    "problem": "Ken Kesey, the book's main character, tried to alert Middle America  to the new consciousness that he believed LSD would produce by taking a cross-country trip in a bus painted with psychedelic colors.",
    "type": "MM"
  },
  {
    "problem": "One of the funniest scenes in the book occurs when the Hell's Angels come to visit Kesey's Merry Pranksters, the consciousness of the Angels is a little newer than the Pranksters bargained for.",
    "type": "ROS"
  },
  {
    "problem": "Acid Test  brilliantly captures all the excesses of a culture beginning to come apart at the seams; this makes it one of the best introductions for anyone who wishes to understand the 1960s.",
    "type": "PR"
  },
  {
    "problem": "Harry decided that either we would go to the picnic in one car or drive in separate cars.",
    "type": "PAR"
  },
  {
    "problem": "When the wind comes over the mountain, causing snow to fly into hikers’ eyes and freezing their hair.",
    "type": "FRAG"
  },
  {
    "problem": "Roberta outlined her paper carefully, wrote a decent first draft, and took all suggestions into consideration when she produced her final draft, which made her essay a success.",
    "type": "PR"
  },
  {
    "problem": "Herman, along with his family, go to the same restaurant every Saturday; their status as “regulars” has earned them a coveted corner table in the Rainforest Room.",
    "type": "AGREE"
  },
  {
    "problem": "Coach Stevens gave a great halftime speech to the team, despite his enthusiasm, the players got pasted by the opposition, 55 – 3.",
    "type": "ROS"
  },
  {
    "problem": "The committee decided to give the award to whoever deserved it most; that person turned out to be Hermione.",
    "type": "A"
  },
  {
    "problem": "Waiting for the bus from Omaha  to arrive, the lobby of the bus station was quiet and still, with only the muted singing of the shoeshine boy breaking the silence.",
    "type": "DM"
  },
  {
    "problem": "The engine repair class is going very well; all we need is a real car to rebuild right down to the hubcaps, since us students are ready to put our knowledge to good use.",
    "type": "CASE"
  },
  {
    "problem": "Bob is the only one of those workers who have the courage to confront his tyrannical boss.",
    "type": "AGREE"
  },
  {
    "problem": "Patricia only gave me five tickets for the air show, when I specifically told her I needed seven, one for me and six for my cousins visiting from Topeka .",
    "type": "MM"
  },
  {
    "problem": "Give the book to Hermione or I; I do not know whom it belongs to, but one of us will find out.",
    "type": "CASE"
  },
  {
    "problem": "Charlemagne, the head monitor and captain of the speech team, is both skillful and she is articulate.",
    "type": "PAR"
  },
  {
    "problem": "At first, I was shocked by the tone of the editorial; however, after examining the context, the angry words seemed justified.",
    "type": "DM"
  },
  {
    "problem": "Bill is one of the boys who are constantly late. Even though he usually has a plausible excuse.",
    "type": "FRAG"
  },
  {
    "problem": "Mrs. James, usually accompanied by her three children, regularly attend the First Baptist Church.",
    "type": "AGREE"
  },
  {
    "problem": "The Spartans blocked listlessly, ran poorly, and showed little spirit, which explained their mediocre record.",
    "type": "PR"
  },
  {
    "problem": "He returned the computer to the store which was defective, and he refused to accept a replacement; instead, he demanded and received a cash refund.",
    "type": "MM"
  },
  {
    "problem": "Neither Bill nor he has come forward to pay the fine, nevertheless, the town will probably grant an extension.",
    "type": "ROS"
  },
  {
    "problem": "He is not only skillful but suave and not only handsome but intelligent; in sum, he is a boy toward whom almost everyone feels deep envy, if not outright loathing.",
    "type": "A"
  },
  {
    "problem": "Apparently, what angered Mr. Polk was me giving my ideas freely to the rest of the students, who then used those ideas in a series of opinion articles that were critical of his teaching.",
    "type": "CASE"
  }
]